test/xml/request_signed.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"><soapenv:Header><wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#"><ds:SignedInfo><ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"></ds:CanonicalizationMethod><ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"></ds:SignatureMethod><ds:Reference URI="#TS-286F409F5B2F79465265"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"></ds:Transform></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"></ds:DigestMethod><ds:DigestValue>vT/rr89jQTgucC7X0zGCdiemY3A=</ds:DigestValue></ds:Reference><ds:Reference URI="#ID-286F409F5B2F79465265"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"></ds:Transform></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"></ds:DigestMethod><ds:DigestValue>3WK19DwFqHVSVhvNhRo9OSZ/t1c=</ds:DigestValue></ds:Reference></ds:SignedInfo><ds:SignatureValue>BakTOSkZyFWtCM271BABkuZWVHK3SxsUNTLidPWa3qDPerGB4RN70p7FXU8FLdMwxd1Xm5I8YQ5egPwVyAnr1tBDW3GD4lDoe/QjDbnMg88N8ay8zj24UaW7kaVEIs4wu0MzgIt+XzV4YhHDSQqCOpyNk5UXpcIK8ZVRtTnNWQzWR7LWs/zfC0maPkPqpyQ2OJ0w6w8nUb5Ey/kIVH2kyd5/CJuTX/kBo1Nw8EPL2Hn8JFBM+6+ZzFWIGYivi5iBlzw/PcaeNmnVIH8jA/H8kbwfjoHnLYn+JH7pxwD0BI6RVxr0aTLTMU9V4zW/R/sN3wiPYJ2rzotJFA4aQZ/1Cw==</ds:SignatureValue><ds:KeyInfo xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="KI-286F409F5B2F79465265"></ds:KeyInfo></ds:Signature><wsu:Timestamp xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="TS-286F409F5B2F79465265"><wsu:Created>2020-03-09T12:34:13+00:00</wsu:Created><wsu:Expires>2020-03-09T13:04:13+00:00</wsu:Expires></wsu:Timestamp></wsse:Security><wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#"><ds:SignedInfo><ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"></ds:CanonicalizationMethod><ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"></ds:SignatureMethod><ds:Reference URI="#TS-FB4B3B2A995B83BB0F50"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"></ds:Transform></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"></ds:DigestMethod><ds:DigestValue>8YBdvGLfB1Pso7knUtYlLyONdK4=</ds:DigestValue></ds:Reference><ds:Reference URI="#ID-FB4B3B2A995B83BB0F50"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"></ds:Transform></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"></ds:DigestMethod><ds:DigestValue>fjXsb7HpIbPixcoMitqU0RFmBsE=</ds:DigestValue></ds:Reference></ds:SignedInfo><ds:SignatureValue>NBPm3K+DJhD5fuQfEb3Jq536GFL0kLV4AZuBxh19KAtDDWtyH/pAGFCghMRvzR2gcL4L9VRYHoj3i27Qm79ptSxazuO5LZrjuK+z/ZnJvxZcIXYuHoM0BAsbA/XINPfpdL4wSJQZhKCO7oKGamO5j5+sO0eOfXE6RUQrrZvr5sbyJ+Fvsy/nmz17ub/fJR5O55j39Bb2jfi32pQNv1fmubUEnn57ekw6jUVnRGoI1/Gc3Nm4TX+9x2YpED+SFDjtzK0uvEsWu7Q3G2e9mdD1isTsbC/qXefQZNQkLCbstTVfxCA5tl2zbwnP5fgdLi2ShoqHefkuDE0DznSowUUMNQ==</ds:SignatureValue><ds:KeyInfo xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="KI-FB4B3B2A995B83BB0F50"></ds:KeyInfo></ds:Signature><wsu:Timestamp xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="TS-FB4B3B2A995B83BB0F50"><wsu:Created>2020-03-09T12:34:13+00:00</wsu:Created><wsu:Expires>2020-03-09T13:04:13+00:00</wsu:Expires></wsu:Timestamp></wsse:Security></soapenv:Header><soapenv:Body xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="ID-FB4B3B2A995B83BB0F50"><mpay:GetOrderDetails xmlns:mpay="https://mpay.gov.md/"><mpay:query><mpay:OrderKey>3BEEA3B3-B2C3-46AC-96F4-44FC4DAA9AED</mpay:OrderKey><mpay:ServiceID>MPaySampleService</mpay:ServiceID><mpay:Language>ro</mpay:Language></mpay:query></mpay:GetOrderDetails></soapenv:Body></soapenv:Envelope>